{
  "productsData": [
    {
      "id": 1,
      "slug": "pure-argan-oil",
      "name": "Pure Moroccan Argan Oil",
      "description": "For centuries, the women of Morocco's Atlas Mountains have guarded the secret of the 'liquid gold' argan tree. Harvested by hand from UNESCO-protected forests, our argan oil follows ancient Berber traditions while meeting modern purity standards. Each bottle contains the essence of approximately 30 argan nuts, cold-pressed within 24 hours of harvesting to preserve its potent antioxidants. Experience the legendary beauty secret that has maintained radiant skin and lustrous hair across generations of Moroccan royalty.",
      "story": "Known as 'Berber gold,' argan oil has been Morocco's best-kept beauty secret for over 800 years. Traditionally produced by women's cooperatives, this precious oil was so valued that families would gift it to brides as part of their dowry. Our oil comes from sustainable women-led cooperatives in Essaouira, where each harvest supports education and healthcare initiatives for local communities.",
      "shortDescription": "Premium organic argan oil from Morocco - The legendary 'liquid gold' of the Berber people",
      "price": 299,
      "currency": "SEK",
      "originalPrice": 349,
      "category": "face-oils",
      "subcategory": "premium-oils",
      "tags": [
        "organic",
        "vegan",
        "anti-aging",
        "cold-pressed",
        "sustainable",
        "berber-tradition"
      ],
      "ingredients": ["100% Argania Spinosa Kernel Oil"],
      "skinType": ["dry", "combination", "sensitive", "aging"],
      "volume": "30ml",
      "images": ["/images/argan.png"],
      "features": [
        "Reduces fine lines and wrinkles",
        "Deeply moisturizes without greasy feel",
        "Strengthens hair and reduces split ends",
        "Improves skin elasticity"
      ],
      "benefits": [
        "Antioxidant protection",
        "Non-comedogenic",
        "Quick absorption",
        "Suitable for all skin types"
      ],
      "rating": 4.2,
      "reviews": 124,
      "inStock": true,
      "isFeatured": true,
      "isBestseller": true,
      "stockLevel": 45
    },
    {
      "id": 2,
      "slug": "rosehip-face-oil",
      "name": "Organic Rosehip Oil",
      "description": "Harvested from wild roses growing in the pristine valleys of Chile's Patagonia region, our rosehip oil captures the regenerative power of one of nature's most resilient plants. The Rosa Canina rose bushes survive harsh winters to produce nutrient-dense berries each autumn. Traditionally used by indigenous Mapuche communities for healing scars and revitalizing skin, this brightening oil contains naturally occurring tretinoin—a vitamin A compound renowned for its skin-renewing properties. Watch as your complexion transforms with the glow of Patagonian wilderness.",
      "story": "The Mapuche people of Chile have used rosehip for centuries as a healing remedy for wounds and skin ailments. During WWII, British pilots reportedly used rosehip oil to heal burns and scars from cockpit fires. Our oil is sourced from organic farms in the Bio-Bío region, where roses grow wild in mineral-rich volcanic soil, producing berries with exceptionally high vitamin C content.",
      "shortDescription": "Brightening and rejuvenating rosehip oil from Chilean Patagonia",
      "price": 239,
      "currency": "SEK",
      "category": "face-oils",
      "subcategory": "brightening-oils",
      "tags": [
        "organic",
        "anti-aging",
        "brightening",
        "scar-treatment",
        "patagonian"
      ],
      "ingredients": ["Rosa Canina Fruit Oil", "Natural Vitamin E"],
      "skinType": ["dry", "combination", "acne-prone", "scarred"],
      "volume": "30ml",
      "images": ["/images/rose.png"],
      "features": [
        "Brightens uneven skin tone",
        "Reduces appearance of dark spots",
        "Improves skin elasticity and firmness",
        "Helps fade acne scars"
      ],
      "rating": 4.6,
      "reviews": 89,
      "inStock": true,
      "isFeatured": false,
      "isBestseller": true,
      "stockLevel": 32
    },
    {
      "id": 3,
      "slug": "jojoba-oil",
      "name": "Golden Jojoba Oil",
      "description": "Discovered by Native American tribes in the Sonoran Desert, jojoba is actually a liquid wax that perfectly mimics human sebum—making it nature's most compatible moisturizer. Our golden jojoba comes from sustainable farms in Arizona where plants grow slowly under intense desert sun, developing exceptionally stable oil. The O'odham people traditionally used jojoba to protect skin from harsh desert winds and heal wounds. Today, dermatologists recommend it as the closest natural match to your skin's own oils, making it ideal for rebalancing both dry and oily complexions.",
      "story": "Jojoba was nearly driven to extinction in the 1970s when whale oil was banned and cosmetic companies turned to it as an alternative. Conservation efforts led to sustainable cultivation that now protects both the plant and its desert ecosystem. Our supplier partners with Native American-owned farms that practice regenerative agriculture, ensuring each harvest improves soil health in the arid Southwest.",
      "shortDescription": "Balancing desert oil that mirrors your skin's natural sebum",
      "price": 249,
      "currency": "SEK",
      "category": "face-oils",
      "subcategory": "balancing-oils",
      "tags": [
        "organic",
        "non-comedogenic",
        "balancing",
        "lightweight",
        "desert-gold"
      ],
      "ingredients": ["Simmondsia Chinensis Seed Oil"],
      "skinType": ["oily", "combination", "acne-prone", "sensitive"],
      "volume": "50ml",
      "images": ["/images/argan.png"],
      "features": [
        "Balances natural oil production",
        "Lightweight, non-greasy formula",
        "Soothes irritated skin",
        "Can be used as makeup remover"
      ],
      "rating": 4.7,
      "reviews": 156,
      "inStock": true,
      "isFeatured": true,
      "isBestseller": false,
      "stockLevel": 67
    },
    {
      "id": 4,
      "slug": "virgin-coconut-oil",
      "name": "Virgin Coconut Oil",
      "description": "Sourced from family-owned coconut groves in the Philippines' Davao region, our virgin coconut oil is harvested using a 2000-year-old traditional method called 'kakang gata.' Fresh coconut milk is slowly fermented for 24 hours, allowing the oil to naturally separate—a process that preserves delicate nutrients lost in commercial extraction. Philippine folklore tells of 'bathala' (gods) gifting coconut trees to provide 'food, shelter, and medicine.' Experience this tropical treasure that has nourished Pacific Island communities for millennia, now available to transform your beauty and wellness rituals.",
      "story": "In Philippine tradition, the coconut palm is called the 'Tree of Life'—every part is used. Our oil comes from third-generation farmers in Davao who still climb trees by hand (no mechanical harvesters) to select only the most mature nuts. The 'virgin' designation means the oil is extracted without chemicals or high heat, preserving its natural aroma and lauric acid content—the same compound found in mother's milk.",
      "shortDescription": "Multi-purpose coconut oil—the Pacific's 'Tree of Life' in a bottle",
      "price": 199,
      "currency": "SEK",
      "originalPrice": 249,
      "category": "multi-use",
      "subcategory": "tropical-oils",
      "tags": [
        "organic",
        "virgin",
        "cold-pressed",
        "multi-purpose",
        "tropical",
        "tree-of-life"
      ],
      "ingredients": ["100% Cocos Nucifera Oil"],
      "skinType": ["dry", "normal", "all"],
      "hairType": ["dry", "damaged", "curly", "all"],
      "volume": "200ml",
      "images": ["/images/coconut.png"],
      "uses": [
        "Hair mask and conditioner",
        "Body moisturizer",
        "Makeup remover",
        "Massage oil",
        "Cooking oil"
      ],
      "features": [
        "Natural antimicrobial properties",
        "Deeply nourishes dry hair",
        "Leaves skin soft and supple",
        "Pleasant tropical scent"
      ],
      "benefits": [
        "Rich in lauric acid",
        "Food grade quality",
        "Solid at room temperature",
        "Sustainable sourcing"
      ],
      "rating": 4.5,
      "reviews": 210,
      "inStock": true,
      "isFeatured": true,
      "isBestseller": true,
      "stockLevel": 120
    }
  ]
}
